<b> Pandas Basics <b>

In [2]:
import pandas as pd 
import numpy as np

In [3]:
pd.__version__

'1.2.4'

<b> Series </b>

In [28]:
dict = { "one" : [1,2,3,4]}

In [29]:
dict

{'one': [1, 2, 3, 4]}

In [33]:
my_series = pd.Series(dict)

In [34]:
type(my_series)

pandas.core.series.Series

In [35]:
my_series

one    [1, 2, 3, 4]
dtype: object

In [9]:
my_series.index

Index(['one'], dtype='object')

In [36]:
a1 = np.random.randint(5,size=5)

In [37]:
a1

array([2, 1, 4, 2, 3])

In [38]:
series = pd.Series(a1)

In [39]:
type(series)

pandas.core.series.Series

In [40]:
series

0    2
1    1
2    4
3    2
4    3
dtype: int32

In [41]:
a1 = np.random.randint(5,size=5)
series1 = pd.Series(a1, index=['a','b','c','d','e'])
series1

a    2
b    1
c    2
d    4
e    2
dtype: int32

In [20]:
series1['a']

4

<b> Data Frame </b>

In [42]:
dict = { "id" : [1,2,3,4], "name" : ["a","b","c","d"] }
dict

{'id': [1, 2, 3, 4], 'name': ['a', 'b', 'c', 'd']}

In [43]:
df = pd.DataFrame(dict)

In [44]:
df

   id name
0   1    a
1   2    b
2   3    c
3   4    d

In [45]:
type(df)

pandas.core.frame.DataFrame

In [46]:
df.columns

Index(['id', 'name'], dtype='object')

In [47]:
df.dtypes

id       int64
name    object
dtype: object

In [48]:
s1 = pd.Series([1,2,3,4], name = "id")
s2 = pd.Series(['a','b','c','d'], name = "name")
s3 = pd.Series([True,False,False,True], name = "working")
s4 = pd.Series([1.2,2.4,3.7,4.5], name = "experience")

In [49]:
serieses = [ s1,s2,s3,s4] 
x = pd.DataFrame(serieses)

In [50]:
x

               0      1      2     3
id             1      2      3     4
name           a      b      c     d
working     True  False  False  True
experience   1.2    2.4    3.7   4.5

In [51]:
x.columns

RangeIndex(start=0, stop=4, step=1)

In [52]:
x.T

  id name working experience
0  1    a    True        1.2
1  2    b   False        2.4
2  3    c   False        3.7
3  4    d    True        4.5

In [53]:
y= x.T

In [55]:
type(y)

pandas.core.frame.DataFrame

In [56]:
y.columns

Index(['id', 'name', 'working', 'experience'], dtype='object')

In [57]:
y['id']

0    1
1    2
2    3
3    4
Name: id, dtype: object

<b> Reading Files </b>

In [59]:
df = pd.read_csv("../../data/students.csv")

In [60]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [65]:
type(df)

pandas.core.frame.DataFrame

In [74]:
df_excel = pd.read_excel("../../data/students.xlsx")

In [75]:
df_excel

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [76]:
type(df_excel)

pandas.core.frame.DataFrame

In [78]:
df_excel.columns

Index(['id', 'name', 'quiz1', 'quiz2', 'assignment', 'midsem', 'compre'], dtype='object')

<b> Write to a file </b>

In [79]:
df_excel

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [80]:
df_excel.to_csv("my_first_data_Writing.csv")

<b> Data Selection </b>

In [81]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [82]:
name = df["name"]

In [83]:
name

0    pravin
1     patil
2      john
3     sadiq
4    pravin
Name: name, dtype: object

In [84]:
type(name)

pandas.core.series.Series

In [85]:
list_of_col = ["id", "name", "compre"]
extracted_data = df[list_of_col]

In [86]:
extracted_data

   id    name  compre
0   1  pravin      34
1   2   patil       4
2   3    john      33
3   4   sadiq      11
4   5  pravin      34

In [87]:
type(extracted_data)

pandas.core.frame.DataFrame

In [88]:
id = extracted_data["id"]

In [89]:
type(id)

pandas.core.series.Series

In [52]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [90]:
df.columns

Index(['id', 'name', 'quiz1', 'quiz2', 'assignment', 'midsem', 'compre'], dtype='object')

In [91]:
df.head()

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [92]:
df.head(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4

In [93]:
df.tail(2)

   id    name  quiz1  quiz2  assignment  midsem  compre
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [98]:
df.describe() 
# this is a method !!

             id     quiz1     quiz2  assignment     midsem     compre
count  5.000000  5.000000  5.000000    5.000000   5.000000   5.000000
mean   3.000000  4.600000  4.600000    8.000000  16.000000  23.200000
std    1.581139  0.894427  0.894427    2.738613   9.246621  14.549914
min    1.000000  3.000000  3.000000    5.000000   2.000000   4.000000
25%    2.000000  5.000000  5.000000    5.000000  11.000000  11.000000
50%    3.000000  5.000000  5.000000   10.000000  22.000000  33.000000
75%    4.000000  5.000000  5.000000   10.000000  22.000000  34.000000
max    5.000000  5.000000  5.000000   10.000000  23.000000  34.000000

In [95]:
df.describe(include='all')

              id    name     quiz1     quiz2  assignment     midsem     compre
count   5.000000       5  5.000000  5.000000    5.000000   5.000000   5.000000
unique       NaN       4       NaN       NaN         NaN        NaN        NaN
top          NaN  pravin       NaN       NaN         NaN        NaN        NaN
freq         NaN       2       NaN       NaN         NaN        NaN        NaN
mean    3.000000     NaN  4.600000  4.600000    8.000000  16.000000  23.200000
std     1.581139     NaN  0.894427  0.894427    2.738613   9.246621  14.549914
min     1.000000     NaN  3.000000  3.000000    5.000000   2.000000   4.000000
25%     2.000000     NaN  5.000000  5.000000    5.000000  11.000000  11.000000
50%     3.000000     NaN  5.000000  5.000000   10.000000  22.000000  33.000000
75%     4.000000     NaN  5.000000  5.000000   10.000000  22.000000  34.000000
max     5.000000     NaN  5.000000  5.000000   10.000000  23.000000  34.000000

In [99]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [100]:
df.iloc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

In [101]:
df.iloc[1, 1]

'patil'

In [102]:
df.loc[0]

id                 1
name          pravin
quiz1              5
quiz2              5
assignment        10
midsem            22
compre            34
Name: 0, dtype: object

For example, let’s say we search for the rows whose index is 1, 2 or 100. We will not get the first, second or the hundredth row here. Instead, we will get the results only if the name of any index is 1, 2 or 100.

In [103]:
df.loc[1, "id"]

2

In [104]:
df.loc[1, "name"]

'patil'

In [105]:
df.loc[0:3, ["id","name"]]

   id    name
0   1  pravin
1   2   patil
2   3    john
3   4   sadiq

In [106]:
df

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [121]:
dicc = { "id" : [1,2,3,4], "name" : ["a","b","c","d"] }

In [123]:
dfff = pd.DataFrame(dicc, index=['a','b','c','d'])

In [124]:
dfff

   id name
a   1    a
b   2    b
c   3    c
d   4    d

In [128]:
dfff.loc['a'] # works on row id.

id      1
name    a
Name: a, dtype: object

In [129]:
# dfff.loc[1]  
dfff.iloc[2]  # works on index

id      3
name    c
Name: c, dtype: object

In [130]:
df[df["quiz1"] > 3]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [131]:
df["quiz1"]

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [132]:
df.quiz1

0    5
1    5
2    3
3    5
4    5
Name: quiz1, dtype: int64

In [133]:
df[(df.quiz1 > 3) & (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
4   5  pravin      5      5          10      22      34

In [134]:
df[(df.quiz1 > 3) | (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34

In [135]:
df[(df.quiz1 == 3) | (df.assignment > 7)]

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
2   3    john      3      3           5      11      33
4   5  pravin      5      5          10      22      34

In [136]:
df.query('quiz1 > 3')

   id    name  quiz1  quiz2  assignment  midsem  compre
0   1  pravin      5      5          10      22      34
1   2   patil      5      5          10       2       4
3   4   sadiq      5      5           5      23      11
4   5  pravin      5      5          10      22      34